package conditional_statement;

public class Test3 {

	public static void main(String[] args) {
		// 문자 ch 에 대해 대문자, 소문자, 숫자 판별
		// => 위의 모든 조건이 false 일 때 "기타 문자" 출력
		
		System.out.println("----------------------------");
		
		// 문자 ch 가 대문자일 때 소문자로 변환하고, 소문자일 때 대문자로 변환
		// => 대문자, 소문자가 아닐 경우 "변환 불가!" 출력
		
		System.out.println("==============================");
		
		/*
		 * 학생의 점수를 입력받아 학점 계산 후 출력
		 * - 점수(정수형)를 저장할 변수 score 를 선언하고 임의의 점수 저장
		 * - 학점(문자열)을 저장할 변수 grade 를 선언하고 널스트링("") 저장
		 * 
		 * if문을 사용하여 다음 조건에 맞는 학점을 계산하고
		 * 계산 결과에 따른 학점을 문자열로 grade 변수에 저장
		 * 학점 "A" : 점수가 90 ~ 100
		 * 학점 "B" : 점수가 80 ~ 89
		 * 학점 "C" : 점수가 70 ~ 79
		 * 학점 "D" : 점수가 60 ~ 69
		 * 학점 "F" : 점수가 0 ~ 59
		 * 
		 * < 출력 예시 >
		 * 85점의 학점 : B
		 */

	}

}
